{
  "posts": [
    {
      "post_id": 2,
      "title": "A letter to first year students",
      "short-description": "Sometimes we say and hear that we wanted to do things differently, would you actually do it differently? Well I know it's impossible so I just have to learn from the past.",
      "year": 2021,
      "date": "14 JUL 2021",
      "content": [
        {
          "content_title": "You nervous?",
          "content_text": "I know you just got to university youngling but do not despair, it's not as a monster as people people make it to be. A year ago when I was in your shoes I also thought that I would be crushed by assignments and kept having that little pea under the mattress saying \"you're not smart enough for this\" but that was not what happened. And believe me when I say that you will feel the same by the end of your first year!",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "What is it actually like",
          "content_text": "Well first of all is not a big scary monster, yes sometimes it's a lot of work, yes sometimes you get hard topics on a few modules. But honestly it's quite manageable if you are someone that gets on top of things with time. I'm not going to lie, if you only start doing assignments and work a few days before there's not much to say, you're f****d but if you start doing it with time you'll get it done easy. At least with first year modules you won't have mad 24/7 studing sessions. Yes sometimes you will feel that you have too much work or too many exams but the fear of doing it it's actually harder than the actually studying.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },

        {
          "content_title": "Conclusion",
          "content_text": "Should you still be worried? Well....<strong> Yes </strong>it's still university modules, the right question is Should you still be afraid to fail? <strong>NO</strong>, because you will be able to do this if you put in the time needed. It's all about time management.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        }
      ],
      "video": null,
      "tags": ["Learning", "Letter"],
      "preview": "./resources/images/post2/img_2_preview.jpg"
    },
    {
      "post_id": 1,
      "title": "Student Talks",
      "short-description": "This is the first post on this blog, just a simple  \"Get to know us\", a welcoming for every person. I hope you can find the posts interesting and easy to follow. Welcome to Student Talks",
      "year": 2021,
      "date": "12 JUL 2021",
      "content": [
        {
          "content_title": "Hello",
          "content_text": "My name is João Garrido and im currently a second year computer science student at the University of Liverpool, with this blog I want to give everyone reading a way to see the world of programming and technology through the eyes of a student and the eyes of someone who hasn't started the \"real\" life yet.",
          "content_image": ["./resources/images/post1/myself.jpg"],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Background",
          "content_text": "I started coding 5 years ago when I started secondary school in Portugal and throughout those three years I learnt a lot, mainly about web development and desktop development with c#. I created a few small projects but my main knowledge of programming came from searching for myself to find what I loved to do. I ended up falling in love with kotlin on my third year, when we had to create a big project that showed our programming capabilities and for 1 month I kept searching what to use and ended up using Kotlin with android to develop an app for vegan and vegetarian recipes, happy to say that app provided me with the highest grade possible! Now I'm just student trying to improve my knowledge of programming.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Idea",
          "content_text": "The very first time I thought about doing something like this was around 6 months ago but I was always thinking, - Who's gonna read what I have to write? Well here I am, although I might not be a FAANG developer or have a youtube page or even not have 20 years of experience in coding but I'm gonna give all my knowledge to everyone who's able to read this blog. Once again Welcome to Student Talks.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        }
      ],
      "video": null,
      "tags": ["About-Us", "First"],
      "preview": "./resources/images/post1/img_1_preview.jpg"
    }
  ]
}
