{
  "posts": [
    {
      "post_id": 6,
      "title": "Modeling Data",
      "short-description": "Most of the software projects done nowadays are built according to some pre-determined models.",
      "year": 2022,
      "date": "24 MAY 2022",
      "content": [
        {
          "content_title": "XAMPP",
          "content_text": "XAMPP is a free and open-source cross-platform web server solution stack package developed by Apache Friends, consisting mainly of the <strong>Apache HTTP Server</strong>, MariaDB database, and interpreters for scripts written in the PHP and Perl programming languages.",
          "content_image": ["./resources/post4/img1.jpg"],
          "content_code": null,
          "content_alert": {
            "type": "danger",
            "message": "Before doing any changes to the files please save the original files in case something goes wrong."
          }
        },
        {
          "content_title": "Finding the files",
          "content_text": "To configure a XAMPP server to send emails  we have to make changes to the files sendmail.ini and php.ini. These are found inside the folders <strong>php</strong> and <strong>sendmail</strong>.",
          "content_image": [
            "./resources/post4/img_3.jpg",
            "./resources/post4/img_2.jpg"
          ],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Sendmail.ini",
          "content_text": "Open the file <strong>sendmail.ini</strong> in a text editor and there you will find a few things to change.",
          "content_image": null,
          "content_code": ["./resources/post4/code1.txt"],
          "content_alert": null
        },
        {
          "content_title": "Php.ini",
          "content_text": "Open the file <strong>php.ini</strong> in a text editor and there you will find a few things to change.",
          "content_image": null,
          "content_code": ["./resources/post4/code2.txt"],
          "content_alert": {
            "type": "warning",
            "message": "Be sure to activate access to less secure webapp on your gmail account."
          }
        },
        {
          "content_title": "Testing",
          "content_text": "After completing all the steps above it's time to try sending an email using PHP. Just create a simple website with a form and on submit sends the email.",
          "content_image": null,
          "content_code": ["./resources/post4/code3.php"],
          "content_alert": null
        }
      ],
      "tags": ["Data", "Model", "OOP"],
      "preview": "./resources/post6/img_6_preview.jpg"
    },
    {
      "post_id": 5,
      "title": "Storing Images on a Server",
      "short-description": "The way to go about uploading and storing images on a database (without making it ridiculously slow) for later use.",
      "year": 2021,
      "date": "10 AUG 2021",
      "content": [
        {
          "content_title": "Uploading Images",
          "content_text": "Many new programmers face, at some point, the challenge of uploading images to a server and as me they immediately think of just uploading the image to the database as a blob and that's it, job <strong>DONE</strong>.<br>Well I learnt my mistake a few years ago and I'm here to teach you a new and improved way of doing it, the way I use on my projects.",
          "content_image": ["./resources/post5/img_1.jpg"],
          "content_code": null,
          "content_alert": {
            "type": "warning",
            "message": "This post is just a walkthrough how you should do it and not a programming tutorial, I will eventually have a post on how to upload to database with kotlin and ktor."
          }
        },
        {
          "content_title": "Where do we store them?",
          "content_text": "Well as you might have guessed we would store them in the <strong>filesystem</strong> of the server instead of the database. After storing it on the filesystem you just grab the <strong>path</strong> to the image and insert it to the database. Whenever you need the image you would just get the path and load it from there.",
          "content_image": ["./resources/post5/img_2.jpg"],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "The flow of storing",
          "content_text": "This seems like a hard concept to grasp because then we leave the app with two different components that work together to have a full functionality, the upload to the filesystem and the insert on the database.<br>Here comes the flow of the program, what  I usually do is when the user chooses a image from his phone or pc the program starts the upload while the user keeps doing other things (like inputing username, password, etc..) and when it's done everything should just go smoothly.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Possible Errors",
          "content_text": "A frequent \"error\" with this approach is that if a user decides to cancel what your app does while the app is uploading the image you end up with a lost image on your server for no use.<br> Something you can do is just coding a script that cleans the server once in a while for images with no use.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        }
      ],
      "tags": ["Images", "Database", "Good-Practices"],
      "preview": "./resources/post5/img_5_preview.jpg"
    },
    {
      "post_id": 4,
      "title": "Xampp & PHP email",
      "short-description": "Most programs have a tool to send emails this is how you can set a xampp apache server to send emails through PHP and Google SMTP.",
      "year": 2021,
      "date": "25 JUL 2021",
      "content": [
        {
          "content_title": "XAMPP",
          "content_text": "XAMPP is a free and open-source cross-platform web server solution stack package developed by Apache Friends, consisting mainly of the <strong>Apache HTTP Server</strong>, MariaDB database, and interpreters for scripts written in the PHP and Perl programming languages.",
          "content_image": ["./resources/post4/img1.jpg"],
          "content_code": null,
          "content_alert": {
            "type": "danger",
            "message": "Before doing any changes to the files please save the original files in case something goes wrong."
          }
        },
        {
          "content_title": "Finding the files",
          "content_text": "To configure a XAMPP server to send emails  we have to make changes to the files sendmail.ini and php.ini. These are found inside the folders <strong>php</strong> and <strong>sendmail</strong>.",
          "content_image": [
            "./resources/post4/img_3.jpg",
            "./resources/post4/img_2.jpg"
          ],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Sendmail.ini",
          "content_text": "Open the file <strong>sendmail.ini</strong> in a text editor and there you will find a few things to change.",
          "content_image": null,
          "content_code": ["./resources/post4/code1.txt"],
          "content_alert": null
        },
        {
          "content_title": "Php.ini",
          "content_text": "Open the file <strong>php.ini</strong> in a text editor and there you will find a few things to change.",
          "content_image": null,
          "content_code": ["./resources/post4/code2.txt"],
          "content_alert": {
            "type": "warning",
            "message": "Be sure to activate access to less secure webapp on your gmail account."
          }
        },
        {
          "content_title": "Testing",
          "content_text": "After completing all the steps above it's time to try sending an email using PHP. Just create a simple website with a form and on submit sends the email.",
          "content_image": null,
          "content_code": ["./resources/post4/code3.php"],
          "content_alert": null
        }
      ],
      "tags": ["PHP", "Xampp", "Email"],
      "preview": "./resources/post4/img_4_preview.jpg"
    },
    {
      "post_id": 3,
      "title": "Hosting on github",
      "short-description": "Many of us programmers enjoy doing our own little projects to ourselves and sometimes we just need to host these projects somewhere, here's how.",
      "year": 2021,
      "date": "15 JUL 2021",
      "content": [
        {
          "content_title": "Github Pages",
          "content_text": "Pages is a <strong>service</strong> to host static websites that use HTML, CSS, and JavaScript files straight from your repository on GitHub. Technically we are not able to create dynamic websites but with a little bit of magic hands we are able to do it.<br><br>In the next few paragraphs you will learn how to host <strong>dynamic</strong> websites on github pages for free. You won't need anything like SQL or PHP, the only technologies used here is pure HTML, CSS, JavaScript and JSON.",
          "content_image": ["./resources/post3/img_1.jpg"],
          "content_code": null,
          "content_alert": {
            "type": "warning",
            "message": "In my experience pages should only be used in case of a small easy maintainable website due to the data being stored on a json file."
          }
        },
        {
          "content_title": "Setting Up the repository",
          "content_text": "As you normally do create a new repository. Give it the name you want and make it private or public. Upload an <strong>index.html</strong> page just to initiate the repository. Once created and uploaded go to <strong>settings</strong> on the side menu you will find <strong>Pages</strong>, after this you'll find the following dropdown, choose the same values and save.",
          "content_image": ["./resources/post3/img_2.JPG"],
          "content_code": null,
          "content_alert": {
            "type": "info",
            "message": "Your website will be hosted in a similar url:<br> https://your-username.github.io/repositoryName"
          }
        },
        {
          "content_title": "Project setup",
          "content_text": "Now create a project on your preferred editor with the usual html, css, javascript pages. I would recommend for you to <strong>modularize</strong> the project the following way:",
          "content_image": null,
          "content_code": ["./resources/post3/code1.treeview"],
          "content_alert": null
        },
        {
          "content_title": "Creating the data",
          "content_text": "For this part you will need to create a json file, this will be your \"database\". Organise the data however you see fit to your program.<br> In this example you are able to see a todo <strong>object</strong> with an <strong>id</strong>, a <strong>date</strong> and a <strong>message</strong>. We will use these three properties to show how you can build your website.",
          "content_image": null,
          "content_code": ["./resources/post3/code2.json"],
          "content_alert": null
        },
        {
          "content_title": "Fetching the data",
          "content_text": "Here you can see in the following code how to create a javascript file that will <strong>fetch</strong> that data from the json file and show it on the html page.You should already have an html page linked to a javascript file. (And yes I do use semicolons on javascript...)",
          "content_image": null,
          "content_code": ["./resources/post3/code3.js"],
          "content_alert": null
        },
        {
          "content_title": "Final result",
          "content_text": "So now that everything is coded just upload the files to github and if you followed all the parts correctly you will be able to see the page that follows:",
          "content_image": ["./resources/post3/img_3.JPG"],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Ending",
          "content_text": "I hope you found this tutorial easy to follow, if you have any doubts to hesitate to contact me through the channels displayed on the footer.",
          "content_image": null,
          "content_code": null,
          "content_alert": {
            "type": "info",
            "message": "If you need to read more about pages go to <a target='_blank' href='https://docs.github.com/en/pages'>https://docs.github.com/en/pages</a>"
          }
        }
      ],
      "tags": ["Hosting", "Github", "Web Dev", "JavaScript", "html", "css"],
      "preview": "./resources/post3/img_3_preview.jpg"
    },
    {
      "post_id": 2,
      "title": "A letter to first year students",
      "short-description": "Sometimes we say and hear that we wanted to do things differently, would you actually do it differently? Well I know it's impossible so I just have to learn from the past.",
      "year": 2021,
      "date": "14 JUL 2021",
      "content": [
        {
          "content_title": "You nervous?",
          "content_text": "I know you just got to university youngling but do not despair, it's not as a monster as people make it to be. A year ago when I was in your shoes I also thought that I would be crushed by assignments and kept having that little pea under the mattress saying \"you're not smart enough for this\" but that was not what happened. And believe me when I say that you will feel the same by the end of your first year!",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "What is it actually like",
          "content_text": "Well first of all is not a big scary monster, yes sometimes it's a lot of work, yes sometimes you get hard topics on a few modules. But honestly it's quite manageable if you are someone that gets on top of things with time. I'm not going to lie, if you only start doing assignments and work a few days before there's not much to say, you're f****d but if you start doing it with time you'll get it done easy. At least with first year modules you won't have mad 24/7 studying sessions. Yes sometimes you will feel that you have too much work or too many exams but the fear of doing it it's actually harder than the actually studying.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Conclusion",
          "content_text": "Should you still be worried? Well.... <strong>Yes</strong> it's still university modules, the right question is Should you still be afraid to fail? <strong>NO</strong>, because you will be able to do this if you put in the time needed. It's all about time management.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        }
      ],
      "tags": ["Learning", "Letter"],
      "preview": "./resources/post2/img_2_preview.jpg"
    },
    {
      "post_id": 1,
      "title": "Student Talks",
      "short-description": "This is the first post on this blog, just a simple  \"Get to know us\", a welcoming for every person. I hope you can find the posts interesting and easy to follow. Welcome to Student Talks",
      "year": 2021,
      "date": "12 JUL 2021",
      "content": [
        {
          "content_title": "Hello",
          "content_text": "My name is João Garrido and im currently a second year computer science student at the University of Liverpool, with this blog I want to give everyone reading a way to see the world of programming and technology through the eyes of a student and the eyes of someone who hasn't started the \"real\" life yet.",
          "content_image": ["./resources/post1/myself.jpg"],
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Background",
          "content_text": "I started coding 5 years ago when I started secondary school in Portugal and throughout those three years I learnt a lot, mainly about web development and desktop development with c#. I created a few small projects but my main knowledge of programming came from searching for myself to find what I loved to do. I ended up falling in love with kotlin on my third year, when we had to create a big project that showed our programming capabilities and for 1 month I kept searching what to use and ended up using Kotlin with android to develop an app for vegan and vegetarian recipes, happy to say that app provided me with the highest grade possible! Now I'm just student trying to improve my knowledge of programming.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        },
        {
          "content_title": "Idea",
          "content_text": "The very first time I thought about doing something like this was around 6 months ago but I was always thinking, - Who's gonna read what I have to write? Well here I am, although I might not be a FAANG developer or have a youtube page or even not have 20 years of experience in coding but I'm gonna give all my knowledge to everyone who's able to read this blog. Once again Welcome to Student Talks.",
          "content_image": null,
          "content_code": null,
          "content_alert": null
        }
      ],
      "tags": ["About-Us", "First"],
      "preview": "./resources/post1/img_1_preview.jpg"
    }
  ]
}
